<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2
import sqlalchemy
from sqlalchemy import text

In [3]:
connection = psycopg2.connect(
    dbname = DBNAME,
    user = USER,
    host = HOST,
    password = PASSWORD,
    port = PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
query_3_1 = f'''select count(id)
                from vacancies
             '''

In [6]:
# df = pd.read_sql_query(query_3_1, connection)
# df

result = conn.execute(text(query_3_1)).fetchall()
df = pd.DataFrame(result)
df

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
query_3_2 = f'''select count(id)
                from employers
             '''

In [8]:
# df = pd.read_sql_query(query_3_2, connection)
# df

result = conn.execute(text(query_3_2)).fetchall()
df = pd.DataFrame(result)
df

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
query_3_3 = f'''select count(id)
                from areas
             '''

In [10]:
# df = pd.read_sql_query(query_3_3, connection)
# df

result = conn.execute(text(query_3_3)).fetchall()
df = pd.DataFrame(result)
df

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
query_3_4 = f'''select count(id)
                from industries
             '''

In [12]:
# df = pd.read_sql_query(query_3_4, connection)
# df

result = conn.execute(text(query_3_4)).fetchall()
df = pd.DataFrame(result)
df

   count
0    294

***

**В топ-5 регионов по числу вакансий входят:** Москва (5333), Санкт-Петербург(2851), Минск(2112), Новосибирск(2006) и Алматы(1892).  
**В топ-5 работодателей по числу вакансий входят:** Яндекс(1933), Ростелеком(491), Тинькофф(444), СБЕР(428) и Газпром нефть(331).  
**В топ-5 вакансий по кол-ву входят:** Системный администратор(1761), Программист 1С(1153), Бизнес-аналитик(488), Специалист тех. поддержки(457) и Системный аналитик(432).  
**Самое большое кол-во вакансий по топ-5 городам:** Москва - Бизнес-аналитик(173), Санкт-Петербург - Системный администратор(68), Минск - Системный администратор(55), Новосибирск - Программист 1С(54) и Алматы - Системный администратор(52).  
**В топ-5 сфер деятельности (исключая None) по числу вакансий входят:** Разработка программного обеспечения(12499), Системная интеграция, автоматизации...(11034), Интернет-компании(6413), Банк(2742) и Мобильная связь(1585).

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
query_4_1 = f'''select t1.name, count(t2.id) as cnt
                from areas t1 join vacancies t2 on t1.id = t2.area_id
                group by t1.id
                order by cnt desc
                limit 5
             '''

In [14]:
# df = pd.read_sql_query(query_4_1, connection)
# df

result = conn.execute(text(query_4_1)).fetchall()
df = pd.DataFrame(result)
df

              name   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
query_4_2 = f'''select count(id)
                from vacancies
                where salary_to is not null or salary_from is not null
             '''

In [16]:
# df = pd.read_sql_query(query_4_2, connection)
# df

result = conn.execute(text(query_4_2)).fetchall()
df = pd.DataFrame(result)
df

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
query_4_3 = f'''select round(avg(salary_from)) as avg_from, round(avg(salary_to)) as avg_to
                from vacancies
             '''

In [18]:
# df = pd.read_sql_query(query_4_3, connection)
# df

result = conn.execute(text(query_4_3)).fetchall()
df = pd.DataFrame(result)
df

  avg_from  avg_to
0    71065  110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
query_4_4 = f'''select schedule, employment, count(id)
                from vacancies
                group by schedule, employment
                order by count(id) desc
             '''

In [20]:
# df = pd.read_sql_query(query_4_4, connection)
# df

result = conn.execute(text(query_4_4)).fetchall()
df = pd.DataFrame(result)
df

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
query_4_5 = f'''select experience, count(id)
                from vacancies
                group by experience
                order by count(id)
             '''

In [22]:
# df = pd.read_sql_query(query_4_5, connection)
# df

result = conn.execute(text(query_4_5)).fetchall()
df = pd.DataFrame(result)
df

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

* Как ни странно, но больше всего вакансий требует опыт работы от 1 до 3 лет, а меньше всего вакансий - с опытом работы больше 6 лет. Это может говорить о том, что либо работодатель нуждается в сотрудниках с минимальным опытом работы для того, чтобы "вырастить" специалистов для себя и при этом платить им меньше, чем готовому специалисту с большим опытом работы, либо же это говорит о том, что для работодателей не так важен большой стаж работы - они считают, что 3 лет достаточно.  
* Средняя зарплата составляет примерно 91000.  
* В 74% всех вакансий (36424) требуется полный рабочий день. В 4 раза меньше (9311) требуется на удаленную работу.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [23]:
query_5_1 = f'''select t2.name, count(t1.id)
                from vacancies t1 left join employers t2 on t1.employer_id = t2.id
                group by t2.name
                order by count(t1.id) desc
                limit 5
             '''

In [24]:
# df = pd.read_sql_query(query_5_1, connection)
# df

result = conn.execute(text(query_5_1)).fetchall()
df = pd.DataFrame(result)
df

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [25]:
query_5_2 = f'''select t1.name, count(distinct t2.id) as amount_employers, count(t3.id) as qty_vacancies
                from areas t1 left join employers t2 on t1.id = t2.area
                              left join vacancies t3 on t1.id = t3.area_id and t2.id = t3.employer_id
                group by t1.name
                having count(t3.id) = 0
                order by count(distinct t2.id) desc
                limit 5
             '''

In [26]:
# df = pd.read_sql_query(query_5_2, connection)
# df

result = conn.execute(text(query_5_2)).fetchall()
df = pd.DataFrame(result)
df

                 name  amount_employers  qty_vacancies
0              Россия               410              0
1           Казахстан               207              0
2  Московская область                75              0
3      Великобритания                23              0
4  Краснодарский край                19              0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [27]:
query_5_3 = f'''select t1.name, count(distinct t3.id) as qty_areas
                from employers t1 join vacancies t2 on t1.id = t2.employer_id
                                  join areas t3 on t2.area_id = t3.id
                group by t1.name
                order by count(distinct t3.id) desc
                limit 10
             '''

In [28]:
# df = pd.read_sql_query(query_5_3, connection)
# df

result = conn.execute(text(query_5_3)).fetchall()
df = pd.DataFrame(result)
df

                         name  qty_areas
0                      Яндекс        181
1                  Ростелеком        152
2                  Спецремонт        116
3      Поляков Денис Иванович         88
4                   ООО ЕФИН          71
5                  Совкомбанк         63
6                         МТС         55
7  ЭФКО, Управляющая компания         49
8                Почта России         48
9                        КРОН         48

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [29]:
query_5_4 = f'''select count(distinct t1.id)
                from employers t1 left join employers_industries t2 on t1.id = t2.employer_id
                                  left join industries t3 on t2.industry_id = t3.id
                where t3.id is null
             '''

In [30]:
# df = pd.read_sql_query(query_5_4, connection)
# df

result = conn.execute(text(query_5_4)).fetchall()
df = pd.DataFrame(result)
df

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [31]:
query_5_5 = f'''select t1.name, count(distinct t3.id) as qty_industries
                from employers t1 left join employers_industries t2 on t1.id = t2.employer_id
                                  left join industries t3 on t2.industry_id = t3.id
                group by t1.name
                having count(distinct t3.id) = 4
                order by t1.name
                offset 2 limit 1
             '''

In [32]:
# df = pd.read_sql_query(query_5_5, connection)
# df

result = conn.execute(text(query_5_5)).fetchall()
df = pd.DataFrame(result)
df

   name  qty_industries
0  2ГИС               4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [33]:
query_5_6 = f'''select count(distinct t1.id)
                from employers t1 left join employers_industries t2 on t1.id = t2.employer_id
                                  left join industries t3 on t2.industry_id = t3.id
                where t3.name = 'Разработка программного обеспечения'
             '''

In [34]:
# df = pd.read_sql_query(query_5_6, connection)
# df

result = conn.execute(text(query_5_6)).fetchall()
df = pd.DataFrame(result)
df

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [35]:
ds = pd.read_html("https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8#%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%BE%D0%B2-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D0%BE%D0%B2")
cities = ds[1]
cities

,№,Город,"Население, тыс. чел. (итоги переписи 2021 года)[5]",Прирост относительно переписи-2010,"Население, тыс. чел.(итоги переписи 2010 года)[6]"
0,1,Москва,13 010,"13,1%",11 504
1,2,Санкт-Петербург,5602,"14,8%",4880
2,3,Новосибирск,1634,"10,9%",1474
3,4,Екатеринбург,1544,"14,4%",1350
4,5,Казань,1309,"14,4%",1144
5,6,Нижний Новгород,1226,NaN,1251
6,7,Челябинск,1190,"5,3%",1130
7,8,Красноярск,1188,"21,6%",977
8,9,Самара,1173,"0,3%",1169
9,10,Уфа,1145,"7,8%",1062
10,11,Ростов-на-Дону,1142,"4,9%",1089
11,12,Омск,1126,NaN,1166
12,13,Краснодар,1099,"43,8%",764
13,14,Воронеж[a],1058,"18,9%",890
14,15,Пермь,1034,"4,3%",991
15,16,Волгоград,1028,"0,7%",1021

In [36]:
city = list(cities['Город'])
city[13] = 'Воронеж'
city = tuple(city)

query_5_7 = f'''with total as (select t2.name, count(t1.id) as qty_vacancies
                               from vacancies t1 join areas t2 on t1.area_id = t2.id
                                                 join employers t3 on t1.employer_id = t3.id
                               where t3.name = 'Яндекс' and t2.name in {city}
                               group by t2.name)

               (select t2.name, count(t1.id) as qty_vacancies
                from vacancies t1 join areas t2 on t1.area_id = t2.id
                                  join employers t3 on t1.employer_id = t3.id
                where t3.name = 'Яндекс' and t2.name in {city}
                group by t2.name
                )
                
                union all
                
                select 'Total', sum(qty_vacancies)
                from total
                
                order by 2
             '''

In [37]:
# df = pd.read_sql_query(query_5_7, connection)
# df

result = conn.execute(text(query_5_7)).fetchall()
df = pd.DataFrame(result)
df

               name qty_vacancies
0              Омск            21
1         Челябинск            22
2        Красноярск            23
3         Волгоград            24
4             Пермь            25
5            Казань            25
6    Ростов-на-Дону            25
7            Самара            26
8               Уфа            26
9         Краснодар            30
10          Воронеж            32
11      Новосибирск            35
12  Нижний Новгород            36
13     Екатеринбург            39
14  Санкт-Петербург            42
15           Москва            54
16            Total           485

***

Вывод можно сделать по регионам, в которых нет вакансий:  
Как видно из запроса, в ТОП-5 попали как страны, так и регионы РФ, что выглядит очень странным, т.к. в самих городах РФ вакансии есть, а в самой стране якобы вакансий нет. Это не логично.  

У 8419 работодателей из 23501 не указана сфера деятельности - т.е. каждая третья компания не указывает сферу деятельности.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [38]:
query_6_1 = f'''select count(id)
                from vacancies
                where upper(name) like '%DATA%' or upper(name) like '%ДАНН%'
             '''

In [39]:
# df = pd.read_sql_query(query_6_1, connection)
# df

result = conn.execute(text(query_6_1)).fetchall()
df = pd.DataFrame(result)
df

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [40]:
query_6_2 = f'''select count(id)
                from vacancies
                where (name ilike '%data scientist%' or name ilike '%data science%' 
                or name ilike '%исследователь данных%' or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%%' or (name like '%ML%' and name not like '%HTML%'))
                and (name ilike '%junior%' or experience = 'Нет опыта' or employment = 'Стажировка')
             '''

In [41]:
# df = pd.read_sql_query(query_6_2, connection)
# df

result = conn.execute(text(query_6_2)).fetchall()
df = pd.DataFrame(result)
df

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [42]:
query_6_3 = f'''select count(id)
                from vacancies
                where (name ilike '%data scientist%' or name ilike '%data science%' 
                or name ilike '%исследователь данных%' or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%%' or (name like '%ML%' and name not like '%HTML%'))
                and (key_skills like '%SQL%' or key_skills like '%postgres%')
             '''

In [43]:
# df = pd.read_sql_query(query_6_3, connection)
# df

result = conn.execute(text(query_6_3)).fetchall()
df = pd.DataFrame(result)
df

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [44]:
query_6_4 = f'''select count(id)
                from vacancies
                where (name ilike '%data scientist%' or name ilike '%data science%' 
                or name ilike '%исследователь данных%' or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%%' or (name like '%ML%' and name not like '%HTML%'))
                and key_skills like '%Python%'
             '''

In [45]:
# df = pd.read_sql_query(query_6_4, connection)
# df

result = conn.execute(text(query_6_4)).fetchall()
df = pd.DataFrame(result)
df

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [46]:
query_6_5 = f'''select  round(avg(length(key_skills) - length(replace(key_skills, '\t', '')) + 1), 2) as avg_skills
                from vacancies
                where name ilike '%data scientist%' or name ilike '%data science%' 
                or name ilike '%исследователь данных%' or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%%' or (name like '%ML%' and name not like '%HTML%')
             '''

In [47]:
# df = pd.read_sql_query(query_6_5, connection)
# df

result = conn.execute(text(query_6_5)).fetchall()
df = pd.DataFrame(result)
df

  avg_skills
0       6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [48]:
query_6_6 = f'''select  experience, round(avg(case when salary_from is null or salary_to is null then
                                                        coalesce(salary_from, 0) + coalesce(salary_to, 0)
                                              else ((coalesce(salary_from, 0) + coalesce(salary_to, 0))/2) end)) as avg_salary
                from vacancies
                where (name ilike '%data scientist%' or name ilike '%data science%' 
                or name ilike '%исследователь данных%' or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%%' or (name like '%ML%' and name not like '%HTML%'))
                and (salary_from is not null or salary_to is not null) and experience = 'От 3 до 6 лет'
                group by experience
             '''

In [49]:
# df = pd.read_sql_query(query_6_6, connection)
# df

result = conn.execute(text(query_6_6)).fetchall()
df = pd.DataFrame(result)
df

      experience avg_salary
0  От 3 до 6 лет     243115

***

Средняя ЗП дата-сайентиста увеличивается каждый раз примерно в 2 раза в зависимости от опыта работы:
    без опыта - 75000, с опытом от 1 до 3 лет - 140000 и больше 3 лет - 243000.  

Среднее кол-во навыков, которое указывается в вакансиях, составляет больше 6, что говорит о том, 
что работодатель выделяет 6 главных для него профессиональных навыков/умений, которыми должен обладать потенциальный
дата-сайентист.  

В 201 вакансии из 480 по критериям отбора дата-сайентистов требуется знание SQL, а знание Python требуется в 351 вакансии. Это говорит о том, что знания Python больше востребованы в данной сфере.

# Общий вывод по проекту

По ключевым словам вакансий статистика следующая:
* *Разработчиков* - 5079 вакансий
* *Аналитиков* - 3396 вакансий
* *Системных администраторов* - 3105 вакансий  

При этом, средняя ЗП у тех вакансий, в которых она указана, составляет:
* *Разработчик* - 125096
* *Аналитик* - 93876
* *Сис. админ.* - 54110  

Низкая ЗП у системных администраторов говорит о том, что рынок перенасыщен такими специалистами.  

**Что касается рынка вакансий по уровню ЗП, то общая картина следующая:**  
1) Наибольшая средняя заработная плата в следующих регионах:  
![](https://i.ibb.co/PcJn3Bf/3.jpg)

2) В топ-5 по кол-ву вакансий и средней ЗП вошли:  
![](https://i.ibb.co/GTGpKGz/2.jpg)  

Как видно из приведенного анализа, средняя ЗП в Новосибирске имеет больший размер чем в Санкт-Петербурге, а в Краснодаре выше, чем в Екатеринбурге.  

**Статистика по средней зарплате в компаниях по вакансиям, у которых указана ЗП, следующая:**  
![](https://i.ibb.co/k0Gxgg9/image.jpg)  
Данная статистика может говорить о том, что такие крупные компании, как Тинькофф и СБЕР, не указывают ЗП в своих вакансиях, так как они не попали в ТОП. А также низкие ЗП у Яндекса и Ростелекома могут говорить о том, что в данных компаниях либо очень много вакансий с реально низкими ЗП, либо это вакансии по разным городам России, где стоимость жизни более низкая и, как следствие, ЗП имеет более низкий размер.